ConfigFiles/Enums/СтатусыОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Признана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетИсправленияПовторяемойОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверенаИсправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПризнана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПланируетсяИсправлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/МестаОбнаруженияОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МестаОбнаруженияОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВСборке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВВетке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ТипыВеток.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыВеток</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяВеткаПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаВерсии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаТехническогоПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеткаДляИсправленияОшибок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/CommonModules/ОшибкиСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общие процедуры для работы с ошибками
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет формирование сообщения по ошибкам, требующим отработки (просроченным, либо со
// сроком исполнения сегодня).
//
// Параметры:
//  Проект - СправочникСсылка.Проекты - проект, в рамках которого требуется
//                                      формировать сообщения по ошибкам
//  Параметры - см. ПараметрыФормированияСообщенийСистемыВзаимодействия
//
Процедура СформироватьСообщенияПоОшибкам(Проект, Параметры = Неопределено) Экспорт 
	
	Если НЕ СистемаВзаимодействия.ИспользованиеДоступно() Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Сформировать сообщения по ошибкам.'"),
								УровеньЖурналаРегистрации.Ошибка,,,
								НСтр("ru = 'Система взаимодействия недоступна.'"));
		Возврат;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = ПараметрыФормированияСообщенийСистемыВзаимодействия(Проект);
	КонецЕсли;
	
	ВыполнитьФормированиеСообщенийПоОшибкам(Параметры);
	
КонецПроцедуры

// Выполняет формирование сообщения по указанной ошибке, требующей отработки.
//
// Параметры:
//  Ошибка - СправочникСсылка.Ошибки - ошибка, требующая отработки.
//  СрокОтработки - Дата - срок отработки ошибки.
//  Комунаправлена - СправочникСсылка.Пользователи - пользователь, которому направлена ошибка.
//  АвторСообщения- СправочникСсылка.Пользователи - пользователь, от лица которого формируется сообщение.
//  ПроверятьИмеющиесяСообщения - Булево - признак необходимости проверки уже имеющихся сообщений данного типа
//
Процедура СформироватьСообщениеПоОшибке(Ошибка, СрокОтработки, КомуНаправлена, АвторСообщения, ПроверятьИмеющиесяСообщения=Ложь) Экспорт
	
	ДатаСегодня = НачалоДня(ТекущаяДата());
	
	ЗаголовокОбсуждения = НСтр("ru='Необходимо отработать ошибку'");
	
	ТекстСообщения = ТекстСообшенияПоОтработкеОшибкиДляОбсуждения(СрокОтработки);
	
	Если СрокОтработки < ДатаСегодня ИЛИ ПроверятьИмеющиесяСообщения Тогда
		// Для просроченных ошибок (либо, если указано в явном виде проверить) необходимо проверить, не было ли ранее сформировано
		// сообщение. Если сообщение имеется- новое генерировать не требуется.
		
		Если СрокОтработки < ДатаСегодня Тогда
			ДатаАнализа = СрокОтработки;
		Иначе
			ДатаАнализа = ДатаСегодня;
		КонецЕсли;
		
		ИмеющиесяСообщения = РаботаССистемойВзаимодействия.СообщенияПоОбъекту(Ошибка,
		                                 КомуНаправлена,
										 АвторСообщения,
										 ЗаголовокОбсуждения,
										 ДатаАнализа);
		
		Если ИмеющиесяСообщения.Количество()>0 Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		РаботаССистемойВзаимодействия.ДобавитьСообщениеПоОбъекту(Ошибка,
	                                     КомуНаправлена,
										 АвторСообщения,
										 ЗаголовокОбсуждения,
										 ТекстСообщения);
	Исключение
		 
		 ИмяСобытия = НСтр("ru ='Формирование сообщений по ошибкам'");
		 
		 ТекстКомментария = НСтр("ru = 'Не удалось добавить сообщение по ошибке для пользователя %Пользователь%'");
		 ТекстКомментария = СтрЗаменить(ТекстКомментария, "%Пользователь%", КомуНаправлена);
		 
		 ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, Ошибка, ТекстКомментария);
				
	КонецПопытки;
										 
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. процедуру РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт

	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбработкаОшибокОжидающихИсправленияПовторяемых;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ОтслеживатьСостояниеПовторяемыхОшибок;
	Настройка.РаботаетСВнешнимиРесурсами = Ложь;

КонецПроцедуры

// Выполняет обработку ошибок, которые ожидают исправления повторяемых ошибок.
Процедура ОбработатьОшибкиОжидающиеИсправленияПовторяемых() Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ОтслеживатьСостояниеПовторяемыхОшибок") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Ошибки.Ссылка КАК Ссылка,
	|	Ошибки.Рассмотрел КАК Рассмотрел,
	|	Ошибки.Зарегистрировал КАК Зарегистрировал,
	|	Ошибки.Владелец КАК Проект,
	|	ПовторяемыеОшибки.Проверена КАК ПовторяемаяОшибкаПроверена,
	|	ПовторяемыеОшибки.Отозвана КАК ПовторяемаяОшибкаОтозвана,
	|	ПовторяемыеОшибки.Владелец КАК ПроектПовторяемойОшибки,
	|	ПовторяемыеОшибки.Код КАК КодПовторяемойОшибки
	|ИЗ
	|	Справочник.Ошибки КАК Ошибки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Ошибки КАК ПовторяемыеОшибки
	|		ПО Ошибки.ПовторяемаяОшибка = ПовторяемыеОшибки.Ссылка
	|			И (ПовторяемыеОшибки.Проверена
	|				ИЛИ ПовторяемыеОшибки.Отозвана)
	|ГДЕ
	|	НЕ Ошибки.ПометкаУдаления
	|	И Ошибки.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОшибок.ОжидаетИсправленияПовторяемойОшибки)"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ТребуетсяИзменение = Ложь;
			
			Если Выборка.ПовторяемаяОшибкаПроверена
				ИЛИ Выборка.ПовторяемаяОшибкаОтозвана Тогда
				ТребуетсяИзменение = Истина;
			КонецЕсли;
			
			Если НЕ ТребуетсяИзменение Тогда
				Продолжить;
			КонецЕсли;
			
			ОшибкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ОшибкаОбъект.Заблокировать();
			
			ТекстПоручения = "";
			
			ПеревелВОжидание = Справочники.Пользователи.ПустаяСсылка();
			
			Для Каждого СтрокаТЧ из ОшибкаОбъект.Протокол Цикл
				Если СтрокаТЧ.Статус = Перечисления.СтатусыОшибок.ОжидаетИсправленияПовторяемойОшибки Тогда
					ПеревелВОжидание = СтрокаТЧ.Автор;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Выборка.ПовторяемаяОшибкаПроверена Тогда
				// Следует перенести исправление повторяемой ошибки, либо отозвать
				
				Если Выборка.Проект = Выборка.ПроектПовторяемойОшибки Тогда
					
					ОшибкаОбъект.Статус = Перечисления.СтатусыОшибок.НеПризнана;
					
					Если ЗначениеЗаполнено(ПеревелВОжидание) Тогда
						ОшибкаОбъект.КомуНаправлена = ПеревелВОжидание;;
					Иначе
						ОшибкаОбъект.КомуНаправлена = Выборка.Зарегистрировал;
					КонецЕсли;
				
					ОшибкаОбъект.ПричиныНепризнания = НСтр("ru='Повторяемая ошибка исправлена'");
					
					ТекстПоручения = НСтр("ru='Повторяемая ошибка исправлена. Данную ошибку следует отозвать'");
					
				Иначе
					ОшибкаОбъект.Статус = Перечисления.СтатусыОшибок.Признана;
					
					Если ЗначениеЗаполнено(ПеревелВОжидание) Тогда
						ОшибкаОбъект.КомуНаправлена = ПеревелВОжидание;
					ИначеЕсли ЗначениеЗаполнено(Выборка.Рассмотрел) Тогда
						ОшибкаОбъект.КомуНаправлена = Выборка.Рассмотрел;
					Иначе
						ОшибкаОбъект.КомуНаправлена = Выборка.Зарегистрировал;
					КонецЕсли;
					
					ТекстПоручения = НСтр("ru='Повторяемая ошибка %ПовторяемаяОшибка% исправлена в проекте %ПроектПовторяемойОшибки%. Необходимо перенести исправление ошибки %ПовторяемаяОшибка% в проект %ПроектОшибки% и одновременно с этим отметить данную ошибку исправленной.'");
					ТекстПоручения = СтрЗаменить(ТекстПоручения, "%ПовторяемаяОшибка%", Выборка.КодПовторяемойОшибки);
					ТекстПоручения = СтрЗаменить(ТекстПоручения, "%ПроектПовторяемойОшибки%", Строка(Выборка.ПроектПовторяемойОшибки));
					ТекстПоручения = СтрЗаменить(ТекстПоручения, "%ПроектОшибки%", Строка(Выборка.Проект));
				КонецЕсли;
				
			ИначеЕсли Выборка.ПовторяемаяОшибкаОтозвана Тогда
				// Следует снова рассмотреть ошибку
				ОшибкаОбъект.Статус = Перечисления.СтатусыОшибок.Зарегистрирована;
				
				Если ЗначениеЗаполнено(ПеревелВОжидание) Тогда
					ОшибкаОбъект.КомуНаправлена = ПеревелВОжидание;
				ИначеЕсли ЗначениеЗаполнено(Выборка.Рассмотрел) Тогда
					ОшибкаОбъект.КомуНаправлена = Выборка.Рассмотрел;
				Иначе
					ОшибкаОбъект.КомуНаправлена = Выборка.Зарегистрировал;
				КонецЕсли;
				
				ТекстПоручения = НСтр("ru='Повторяемая ошибка отозвана, поэтому следует вновь рассмотреть данную ошибку.'");
				
			КонецЕсли;
			
			ОшибкаОбъект.ДобавитьЗаписьВПротокол(Пользователи.ТекущийПользователь(), ТекстПоручения);
			
			ОшибкаОбъект.Записать();
			ОшибкаОбъект.Разблокировать();
			
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Ошибка при обработке ошибки, ожидающей исправления повторяемой: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
			ИмяСобытия = НСтр("ru = 'Обработка ошибок, ожидающих исправления повторяемых'", ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, Выборка.Ссылка, ТекстСообщения);
		
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыФормированияСообщенийСистемыВзаимодействия(Проект)

	ТипЗначения = ТипЗнч(Проект);
	
	Если ТипЗначения = Тип("СправочникСсылка.Проекты") Тогда
		Параметры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Проект, "ПользовательАвторСообщенийСистемыВзаимодействия");
		Параметры.Вставить("Проект", Проект);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверно заданы параметры формирования сообщений системы взаимодействия.'");
	КонецЕсли; 
	
	Возврат Параметры;
	
КонецФункции

Процедура ВыполнитьФормированиеСообщенийПоОшибкам(Параметры)
	
	ДанныеОшибокДляОбработки = ОшибкиДляУведомлений(Параметры.Проект);
	
	Для Каждого ДанныеОшибокПоПользователю из ДанныеОшибокДляОбработки.Строки Цикл
		
		КоличествоОшибокПользователя = ДанныеОшибокПоПользователю.Строки.Количество();
		
		Если КоличествоОшибокПользователя > 5 Тогда
			// Если имеется более 5 ошибок к отработке, генерируется сводное сообщение.
			
			Попытка
				
				ТекстСообщения = ТекстСообшенияПоОтработкеОшибокДляОбсуждения();
				Действия = ДействияВСОобщенииОбОтработкеОшибок();
			
				РаботаССистемойВзаимодействия.ДобавитьНеконтекстноеСообщение(ДанныеОшибокПоПользователю.КомуНаправлена,
										 Параметры.ПользовательАвторСообщенийСистемыВзаимодействия,
										 ТекстСообщения,
										 Действия);
			Исключение
											  
				ИмяСобытия = НСтр("ru ='Формирование сообщений по ошибкам'");
											  
				ТекстКомментария = НСтр("ru = 'Не удалось добавить сообщение по ошибкам для пользователя %Пользователь%'");
				ТекстКомментария = СтрЗаменить(ТекстКомментария, "%Пользователь%", ДанныеОшибокПоПользователю.КомуНаправлена);
											  
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстКомментария);
									  
			КонецПопытки;
				
			Продолжить;
			
		Иначе
			// Если ошибок менее 5- генерируются контекстные сообщения в каждой ошибке.
			
			Для Каждого ДанныеОшибки из ДанныеОшибокПоПользователю.Строки Цикл
				
				Попытка
					СформироватьСообщениеПоОшибке(ДанныеОшибки.Ошибка,
				                              ДанныеОшибки.СрокОтработки,
											  ДанныеОшибки.КомуНаправлена,
											  Параметры.ПользовательАвторСообщенийСистемыВзаимодействия,
					                          Истина);
											  
				Исключение
											  
					ИмяСобытия = НСтр("ru ='Формирование сообщений по ошибкам'");
											  
					ТекстКомментария = НСтр("ru = 'Не удалось добавить сообщение по ошибке для пользователя %Пользователь%'");
					ТекстКомментария = СтрЗаменить(ТекстКомментария, "%Пользователь%", ДанныеОшибки.КомуНаправлена);
											  
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, ДанныеОшибки.Ошибка, ТекстКомментария);
									  
				КонецПопытки;
				
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
							   
КонецПроцедуры

Функция ТекстСообшенияПоОтработкеОшибокДляОбсуждения()
	
	ТекстСообщения = НСтр("ru='Имеются ошибки, срок отработки которых истек или истекает сегодня. Нужно отработать ошибки. Для изменения срока отработки следует обратиться к ответственному за проект, или другому полномочному пользователю.'");
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ТекстСообшенияПоОтработкеОшибкиДляОбсуждения(СрокОтработкиОшибки)
	
	ДатаСегодня = НачалоДня(ТекущаяДата());
	
	Если СрокОтработкиОшибки < ДатаСегодня Тогда
		ТекстСообщения = НСтр("ru='Срок отработки истек. Нужно отработать ошибку. Для изменения срока отработки следует обратиться к ответственному за проект, или другому полномочному пользователю.'");
	Иначе
		ТекстСообщения = НСтр("ru='Срок отработки истекает сегодня. Нужно отработать ошибку. Для изменения срока отработки следует обратиться к ответственному за проект, или другому полномочному пользователю.'");
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

Функция ОшибкиДляУведомлений(Проект)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ошибки.Ссылка КАК Ошибка,
	|	Ошибки.КомуНаправлена КАК КомуНаправлена,
	|	Ошибки.СрокОтработки КАК СрокОтработки,
	|	ВЫБОР
	|		КОГДА Ошибки.СрокОтработки < &ТекущаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Просрочена
	|ИЗ
	|	Справочник.Ошибки КАК Ошибки
	|ГДЕ
	|	НЕ Ошибки.ПометкаУдаления
	|	И Ошибки.Владелец = &Проект
	|	И Ошибки.КомуНаправлена <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И Ошибки.СрокОтработки < &ДатаЗавтра
	|	И Ошибки.СрокОтработки <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ(Ошибки.Обнаружена = ЗНАЧЕНИЕ(Перечисление.МестаОбнаруженияОшибок.ВВетке)
	|				И Ошибки.ВеткаОбнаружения.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыВеток.ВеткаТехническогоПроекта))
	|ИТОГИ ПО
	|	КомуНаправлена"
	;
	
	ТекущаяДата = НачалоДня(Текущаядата());
	ДатаЗавтра = ОбщегоНазначенияСППР.СледующаяДатаПоОсновномуКалендарю();
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("ДатаЗавтра", ДатаЗавтра);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ДействияВСообщенииОбОтработкеОшибок()
	
	Действия = Новый СписокЗначений;
	Действия.Добавить("ПерейтиКСпискуОшибок", НСтр("ru='Перейти к списку ошибок'"));
	
	Возврат Действия;
	
КонецФункции

#КонецОбласти
